testit.yml
---
scenarios:
  testit:
    script: testit.jmx

execution:
- scenario: testit
  concurrency: 20
  ramp-up: 5s

reporting:  # https://github.com/Blazemeter/taurus/blob/master/site/dat/docs/Reporting.md
- module: blazemeter
- module: final-stats
  dump-csv: testit-stats.csv
- module: console
- module: junit-xml